socialNetwork/results/scaling-on-bench1.5-may19/benchmark1.5b-sweep-05-19-26_180214/istio/2000.txt
Running 2m test @ http://155.98.37.84:80
  16 threads and 128 connections

  Thread calibration: mean lat.: 34.063ms, rate sampling interval: 112ms
  Thread calibration: mean lat.: 33.545ms, rate sampling interval: 111ms
  Thread calibration: mean lat.: 34.653ms, rate sampling interval: 115ms
  Thread calibration: mean lat.: 36.213ms, rate sampling interval: 117ms
  Thread calibration: mean lat.: 34.929ms, rate sampling interval: 112ms
  Thread calibration: mean lat.: 33.832ms, rate sampling interval: 109ms
  Thread calibration: mean lat.: 33.931ms, rate sampling interval: 109ms
  Thread calibration: mean lat.: 35.067ms, rate sampling interval: 119ms
  Thread calibration: mean lat.: 34.381ms, rate sampling interval: 111ms
  Thread calibration: mean lat.: 33.048ms, rate sampling interval: 106ms
  Thread calibration: mean lat.: 36.957ms, rate sampling interval: 123ms
  Thread calibration: mean lat.: 34.098ms, rate sampling interval: 112ms
  Thread calibration: mean lat.: 35.193ms, rate sampling interval: 120ms
  Thread calibration: mean lat.: 34.968ms, rate sampling interval: 110ms
  Thread calibration: mean lat.: 35.507ms, rate sampling interval: 118ms
  Thread calibration: mean lat.: 34.840ms, rate sampling interval: 110ms

-----------------------------------------------------------------------
Test Results @ http://155.98.37.84:80 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    34.76ms   73.66ms  92.22ms   99.59%
    Req/Sec   125.42     30.83   200.00     69.66%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   27.50ms
 75.000%   38.49ms
 90.000%   53.34ms
 99.000%   92.22ms
 99.900%  148.61ms
 99.990%    3.88s 
 99.999%    5.01s 
100.000%    5.03s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      11.927     0.000000            1         1.00
      20.703     0.100000        22145         1.11
      22.511     0.200000        44102         1.25
      24.015     0.300000        66217         1.43
      25.583     0.400000        88346         1.67
      27.503     0.500000       110371         2.00
      28.719     0.550000       121272         2.22
      30.255     0.600000       132313         2.50
      32.303     0.650000       143382         2.86
      35.103     0.700000       154444         3.33
      38.495     0.750000       165443         4.00
      40.415     0.775000       170879         4.44
      42.463     0.800000       176433         5.00
      44.639     0.825000       181949         5.71
      47.039     0.850000       187427         6.67
      49.855     0.875000       192962         8.00
      51.487     0.887500       195723         8.89
      53.343     0.900000       198466        10.00
      55.455     0.912500       201212        11.43
      57.951     0.925000       203978        13.33
      60.959     0.937500       206698        16.00
      62.687     0.943750       208094        17.78
      64.671     0.950000       209467        20.00
      66.879     0.956250       210846        22.86
      69.439     0.962500       212235        26.67
      72.319     0.968750       213591        32.00
      74.111     0.971875       214280        35.56
      76.031     0.975000       214969        40.00
      78.527     0.978125       215670        45.71
      80.959     0.981250       216342        53.33
      84.159     0.984375       217031        64.00
      86.015     0.985938       217383        71.11
      88.063     0.987500       217726        80.00
      90.623     0.989062       218067        91.43
      93.375     0.990625       218420       106.67
      96.831     0.992188       218760       128.00
      98.751     0.992969       218927       142.22
     100.863     0.993750       219100       160.00
     103.231     0.994531       219272       182.86
     106.239     0.995313       219442       213.33
     109.823     0.996094       219614       256.00
     111.743     0.996484       219702       284.44
     114.495     0.996875       219787       320.00
     117.183     0.997266       219873       365.71
     120.639     0.997656       219959       426.67
     125.439     0.998047       220045       512.00
     128.703     0.998242       220088       568.89
     131.711     0.998437       220131       640.00
     135.935     0.998633       220174       731.43
     141.951     0.998828       220218       853.33
     150.527     0.999023       220260      1024.00
     159.103     0.999121       220282      1137.78
     166.143     0.999219       220303      1280.00
     182.271     0.999316       220325      1462.86
     379.135     0.999414       220346      1706.67
    1278.975     0.999512       220368      2048.00
    1754.111     0.999561       220379      2275.56
    2148.351     0.999609       220389      2560.00
    2342.911     0.999658       220400      2925.71
    2953.215     0.999707       220411      3413.33
    3203.071     0.999756       220422      4096.00
    3266.559     0.999780       220427      4551.11
    3465.215     0.999805       220432      5120.00
    3526.655     0.999829       220438      5851.43
    3561.471     0.999854       220443      6826.67
    3692.543     0.999878       220449      8192.00
    3815.423     0.999890       220451      9102.22
    3983.359     0.999902       220454     10240.00
    4014.079     0.999915       220457     11702.86
    4165.631     0.999927       220459     13653.33
    4272.127     0.999939       220462     16384.00
    4403.199     0.999945       220463     18204.44
    4702.207     0.999951       220465     20480.00
    4796.415     0.999957       220466     23405.71
    4829.183     0.999963       220467     27306.67
    4849.663     0.999969       220469     32768.00
    4849.663     0.999973       220469     36408.89
    4870.143     0.999976       220470     40960.00
    4993.023     0.999979       220471     46811.43
    4993.023     0.999982       220471     54613.33
    5001.215     0.999985       220472     65536.00
    5001.215     0.999986       220472     72817.78
    5013.503     0.999988       220473     81920.00
    5013.503     0.999989       220473     93622.86
    5013.503     0.999991       220473    109226.67
    5021.695     0.999992       220474    131072.00
    5021.695     0.999993       220474    145635.56
    5021.695     0.999994       220474    163840.00
    5021.695     0.999995       220474    187245.71
    5021.695     0.999995       220474    218453.33
    5025.791     0.999996       220475    262144.00
    5025.791     1.000000       220475          inf
#[Mean    =       34.765, StdDeviation   =       73.661]
#[Max     =     5021.696, Total count    =       220475]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  239779 requests in 2.00m, 3.14GB read
Requests/sec:   1998.41  
Transfer/sec:     26.79MB